#define F_CPU 8000000UL

#include "main.h"
#include "uart.h"
#include "ps_2.h"
//***************************************************************************
// Установки
//unsigned short 0..65536

//***************************************************************************
// Инициализация
void avr_init(void)
{
	
}
//***************************************************************************

//***************************************************************************
int main (void)
{
	avr_init();
 	uart_init();
	ps2_init();
 	sei();

	uart_send(0x37);
	uart_send(0x73);

  	while(1){
		if( keyboard_data ){
			ps2_inputKey(keyboard_data);
			keyboard_data = 0;
		}
  	}
}
