#define F_CPU 8000000UL

#include "main.h"
#include "T1637.h"
#include "Atmega8T0.h"
//***************************************************************************
// Установки
uint8_t sec = 0;
//***************************************************************************
// Инициализация
void avr_init(void)
{

}
//***************************************************************************
//Функция вызыается 10 раз в секунду или каждые 100мс
void ms100(void)
{

}
//Функция вызыается раз в секунду
void second(void)
{
	sec++;
	TM1637_display( 2, sec % 10 );
	TM1637_display( 1, sec / 10 );
}
//***************************************************************************
int main (void)
{
	avr_init();
	t0_init();
 	sei();

	TM1637_init(D4056A);
	_PointFlag = 0;
	TM1637_setBrightness(7);
	uint8_t DispData[] = { 0x10, 0x7f, 0x7f, 0x10 };
	TM1637_display_all(DispData);

  	while(1){
		
  	}
}
